Table of Contents
 Class PatchLoad
Namespace
IdeaRS.OpenModel.Detail
Assembly
IdeaRS.OpenModel.dll
Representation of patch load in IDEA StatiCa Detail
[OpenModelClass(typeof(PatchDevice))]
public class PatchLoad : PatchDevice
Inheritance
object
OpenObject
OpenElementId
PatchDevice
PatchLoad
Inherited Members
 PatchDevice.GeomId
 PatchDevice.MasterComponent
 PatchDevice.MasterPoint
 PatchDevice.Position
 OpenElementId.Id
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Constructors
 PatchLoad()
Constructor
public PatchLoad()
 Edit this page